Hi @atsui-bay1 , thank you for your input .
I have tried to reproduce on version redislabs/rediscloud v2.1.5 using the following script

`resource "rediscloud_subscription_database" "tf-example-db" {
    subscription_id = rediscloud_subscription.tf-example.id
    protocol = "redis"
    name = "database-name"
    memory_limit_in_gb = 1
    data_persistence = "none"
    throughput_measurement_by = "operations-per-second"
    throughput_measurement_value = 10000
    support_oss_cluster_api = false
    external_endpoint_for_oss_cluster_api = false
    replication = true
    modules = [
        {
          name = "RedisJSON"
        },
        {
          name = "RedisBloom"
        }
    ]
    alert {
      name = "dataset-size"
      value = 40
    }
}

data "rediscloud_database" "database" {
  subscription_id = rediscloud_subscription.tf-example.id
  name            = "database-name"
}`

terraform plan passed successfully

`terraform plan
data.rediscloud_essentials_plan.plan: Reading...
data.rediscloud_essentials_plan.plan: Read complete after 2s [name=Single-Zone_1GB]
rediscloud_essentials_subscription.subscription-resource: Refreshing state... [id=201348]
rediscloud_essentials_database.database-resource: Refreshing state... [id=201348/51481151]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # rediscloud_essentials_database.database-resource will be created
  + resource "rediscloud_essentials_database" "database-resource" {
      + activated_on             = (known after apply)
      + cloud_provider           = (known after apply)
      + data_eviction            = "volatile-lru"
      + data_persistence         = "none"
      + db_id                    = (known after apply)
      + enable_default_user      = false
      + enable_payg_features     = false
      + id                       = (known after apply)
      + modules                  = (known after apply)
      + name                     = "database-name"
      + password                 = (sensitive value)
      + private_endpoint         = (known after apply)
      + protocol                 = (known after apply)
      + public_endpoint          = (known after apply)
      + redis_version_compliance = (known after apply)
      + regex_rules              = (known after apply)
      + region                   = (known after apply)
      + replication              = false
      + resp_version             = (known after apply)
      + subscription_id          = 201348
      + tags                     = {
          + "envaaaa" = "qaaaa"
        }

      + alert {
          + name  = "throughput-higher-than"
          + value = 80
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
`
can you please share your script